"1 127 1 4206624772 ,"
"input 4 1 3 320 320 0 ,"
" 339 342 345 348 351 354 357 360 363 366 369 372 375 378 381 384 387 390 393 396 399 402 405 408 411 414 417 420 423 426 445 446 449 468 469 472 477 482 485 486 491 496 499 500 505 510 513 514 515 516 526 527 528 538 539 540 550 552 553 563 564 565 575 576 577 587 588 589 590 600 601 602 612 613 614 624 627 630 633 636 639 642 645 648 651 654 657 660 663 666 669 672 675 678 681 684 687 690 693 696 699 702 705 708 711 714 717 720 723 726 729 732 735 738 741 744 747 750 753 756 759 762 765 conf input landms loc ,"
"conf landms loc ,"
" 126 ,"
"Convolution Conv_0 1 1 input 627 1 3 8 3 3 2 2 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_1 1 1 627 339 1 0 ,"
"Convolution Conv_2 1 1 339 630 8 1 8 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_3 1 1 630 342 1 0 ,"
"Convolution Conv_4 1 1 342 633 1 8 16 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU LeakyRelu_5 1 1 633 345 1 0 ,"
"Convolution Conv_6 1 1 345 636 16 1 16 3 3 2 2 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_7 1 1 636 348 1 0 ,"
"Convolution Conv_8 1 1 348 639 1 16 32 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU LeakyRelu_9 1 1 639 351 1 0 ,"
"Convolution Conv_10 1 1 351 642 32 1 32 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_11 1 1 642 354 1 0 ,"
"Convolution Conv_12 1 1 354 645 1 32 32 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU LeakyRelu_13 1 1 645 357 1 0 ,"
"Convolution Conv_14 1 1 357 648 32 1 32 3 3 2 2 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_15 1 1 648 360 1 0 ,"
"Convolution Conv_16 1 1 360 651 1 32 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU LeakyRelu_17 1 1 651 363 1 0 ,"
"Convolution Conv_18 1 1 363 654 64 1 64 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_19 1 1 654 366 1 0 ,"
"Convolution Conv_20 1 1 366 657 1 64 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU LeakyRelu_21 1 1 657 369 1 0 ,"
"Convolution Conv_22 1 1 369 660 64 1 64 3 3 2 2 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_23 1 1 660 372 1 0 ,"
"Convolution Conv_24 1 1 372 663 1 64 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU LeakyRelu_25 1 1 663 375 1 0 ,"
"Convolution Conv_26 1 1 375 666 128 1 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_27 1 1 666 378 1 0 ,"
"Convolution Conv_28 1 1 378 669 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU LeakyRelu_29 1 1 669 381 1 0 ,"
"Convolution Conv_30 1 1 381 672 128 1 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_31 1 1 672 384 1 0 ,"
"Convolution Conv_32 1 1 384 675 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU LeakyRelu_33 1 1 675 387 1 0 ,"
"Convolution Conv_34 1 1 387 678 128 1 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_35 1 1 678 390 1 0 ,"
"Convolution Conv_36 1 1 390 681 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU LeakyRelu_37 1 1 681 393 1 0 ,"
"Convolution Conv_38 1 1 393 684 128 1 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_39 1 1 684 396 1 0 ,"
"Convolution Conv_40 1 1 396 687 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU LeakyRelu_41 1 1 687 399 1 0 ,"
"Convolution Conv_42 1 1 399 690 128 1 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_43 1 1 690 402 1 0 ,"
"Convolution Conv_44 1 1 402 693 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU LeakyRelu_45 1 1 693 405 1 0 ,"
"Convolution Conv_46 1 1 405 696 128 1 128 3 3 2 2 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_47 1 1 696 408 1 0 ,"
"Convolution Conv_48 1 1 408 699 1 128 256 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU LeakyRelu_49 1 1 699 411 1 0 ,"
"Convolution Conv_50 1 1 411 702 256 1 256 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_51 1 1 702 414 1 0 ,"
"Convolution Conv_52 1 1 414 705 1 256 256 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU LeakyRelu_53 1 1 705 417 1 0 ,"
"Convolution Conv_54 1 1 369 708 1 64 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU LeakyRelu_55 1 1 708 420 1 0 ,"
"Convolution Conv_56 1 1 405 711 1 128 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU LeakyRelu_57 1 1 711 423 1 0 ,"
"Convolution Conv_58 1 1 417 714 1 256 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU LeakyRelu_59 1 1 714 426 1 0 ,"
"Upsample Resize_78 1 1 426 445 1 0 0 0 20 20 ,"
"Add Add_79 2 1 423 445 446 -1 ,"
"Convolution Conv_80 1 1 446 717 1 64 64 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_81 1 1 717 449 1 0 ,"
"Upsample Resize_100 1 1 449 468 1 0 0 0 40 40 ,"
"Add Add_101 2 1 420 468 469 -1 ,"
"Convolution Conv_102 1 1 469 720 1 64 64 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_103 1 1 720 472 1 0 ,"
"Convolution Conv_104 1 1 472 723 1 64 32 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_105 1 1 472 726 1 64 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_106 1 1 726 477 1 0 ,"
"Convolution Conv_107 1 1 477 729 1 16 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_108 1 1 477 732 1 16 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_109 1 1 732 482 1 0 ,"
"Convolution Conv_110 1 1 482 735 1 16 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Concat Concat_111 3 1 723 729 735 485 1 ,"
"ReLU Relu_112 1 1 485 486 ,"
"Convolution Conv_113 1 1 449 738 1 64 32 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_114 1 1 449 741 1 64 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_115 1 1 741 491 1 0 ,"
"Convolution Conv_116 1 1 491 744 1 16 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_117 1 1 491 747 1 16 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_118 1 1 747 496 1 0 ,"
"Convolution Conv_119 1 1 496 750 1 16 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Concat Concat_120 3 1 738 744 750 499 1 ,"
"ReLU Relu_121 1 1 499 500 ,"
"Convolution Conv_122 1 1 426 753 1 64 32 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_123 1 1 426 756 1 64 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_124 1 1 756 505 1 0 ,"
"Convolution Conv_125 1 1 505 759 1 16 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_126 1 1 505 762 1 16 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_127 1 1 762 510 1 0 ,"
"Convolution Conv_128 1 1 510 765 1 16 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Concat Concat_129 3 1 753 759 765 513 1 ,"
"ReLU Relu_130 1 1 513 514 ,"
"Convolution Conv_131 1 1 486 515 1 64 8 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Permute Transpose_132 1 1 515 516 4 0 2 3 1 ,"
"Reshape Reshape_138 1 1 516 526 0 3 3 0 -1 4 0 ,"
"Convolution Conv_139 1 1 500 527 1 64 8 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Permute Transpose_140 1 1 527 528 4 0 2 3 1 ,"
"Reshape Reshape_146 1 1 528 538 0 3 3 0 -1 4 0 ,"
"Convolution Conv_147 1 1 514 539 1 64 8 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Permute Transpose_148 1 1 539 540 4 0 2 3 1 ,"
"Reshape Reshape_154 1 1 540 550 0 3 3 0 -1 4 0 ,"
"Concat Concat_155 3 1 526 538 550 loc 1 ,"
"Convolution Conv_156 1 1 486 552 1 64 4 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Permute Transpose_157 1 1 552 553 4 0 2 3 1 ,"
"Reshape Reshape_163 1 1 553 563 0 3 3 0 -1 2 0 ,"
"Convolution Conv_164 1 1 500 564 1 64 4 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Permute Transpose_165 1 1 564 565 4 0 2 3 1 ,"
"Reshape Reshape_171 1 1 565 575 0 3 3 0 -1 2 0 ,"
"Convolution Conv_172 1 1 514 576 1 64 4 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Permute Transpose_173 1 1 576 577 4 0 2 3 1 ,"
"Reshape Reshape_179 1 1 577 587 0 3 3 0 -1 2 0 ,"
"Concat Concat_180 3 1 563 575 587 588 1 ,"
"Convolution Conv_181 1 1 486 589 1 64 20 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Permute Transpose_182 1 1 589 590 4 0 2 3 1 ,"
"Reshape Reshape_188 1 1 590 600 0 3 3 0 -1 10 0 ,"
"Convolution Conv_189 1 1 500 601 1 64 20 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Permute Transpose_190 1 1 601 602 4 0 2 3 1 ,"
"Reshape Reshape_196 1 1 602 612 0 3 3 0 -1 10 0 ,"
"Convolution Conv_197 1 1 514 613 1 64 20 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Permute Transpose_198 1 1 613 614 4 0 2 3 1 ,"
"Reshape Reshape_204 1 1 614 624 0 3 3 0 -1 0 0 ,"
"Concat Concat_205 3 1 600 612 624 landms 1 ,"
"SoftmaxCaffe Softmax_206 1 1 588 conf 2 ,"
