"1 207 1 4206624772 ,"
"input0 4 1 3 320 320 0 ,"
" 303 306 309 312 315 318 321 324 327 330 333 336 339 342 345 348 351 354 357 360 363 366 369 372 375 378 381 384 387 390 391 393 394 396 397 398 399 400 404 405 406 407 408 409 410 413 414 416 417 419 420 421 422 423 427 428 429 430 431 432 433 436 441 446 449 450 455 460 463 464 469 474 477 478 479 480 481 483 486 489 490 491 492 493 495 498 501 502 503 504 505 507 510 513 514 516 517 518 520 523 526 527 528 529 530 532 535 538 539 540 541 542 544 547 550 551 552 553 554 555 557 560 563 564 565 566 567 569 572 575 576 577 578 579 581 584 587 588 591 594 597 600 603 606 609 612 615 618 621 624 627 630 633 636 639 642 645 648 651 654 657 660 663 666 669 672 675 678 681 684 687 690 693 696 699 702 705 708 711 714 717 720 723 726 729 732 733 734 735 736 737 738 739 740 741 742 743 744 745 746 747 748 749 conf input0 landms loc ,"
"conf landms loc ,"
" 184 ,"
"Convolution Conv_0 1 1 input0 591 1 3 8 3 3 2 2 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_1 1 1 591 303 1 0 ,"
"Convolution Conv_2 1 1 303 594 8 1 8 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_3 1 1 594 306 1 0 ,"
"Convolution Conv_4 1 1 306 597 1 8 16 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU LeakyRelu_5 1 1 597 309 1 0 ,"
"Convolution Conv_6 1 1 309 600 16 1 16 3 3 2 2 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_7 1 1 600 312 1 0 ,"
"Convolution Conv_8 1 1 312 603 1 16 32 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU LeakyRelu_9 1 1 603 315 1 0 ,"
"Convolution Conv_10 1 1 315 606 32 1 32 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_11 1 1 606 318 1 0 ,"
"Convolution Conv_12 1 1 318 609 1 32 32 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU LeakyRelu_13 1 1 609 321 1 0 ,"
"Convolution Conv_14 1 1 321 612 32 1 32 3 3 2 2 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_15 1 1 612 324 1 0 ,"
"Convolution Conv_16 1 1 324 615 1 32 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU LeakyRelu_17 1 1 615 327 1 0 ,"
"Convolution Conv_18 1 1 327 618 64 1 64 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_19 1 1 618 330 1 0 ,"
"Convolution Conv_20 1 1 330 621 1 64 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU LeakyRelu_21 1 1 621 333 1 0 ,"
"Convolution Conv_22 1 1 333 624 64 1 64 3 3 2 2 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_23 1 1 624 336 1 0 ,"
"Convolution Conv_24 1 1 336 627 1 64 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU LeakyRelu_25 1 1 627 339 1 0 ,"
"Convolution Conv_26 1 1 339 630 128 1 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_27 1 1 630 342 1 0 ,"
"Convolution Conv_28 1 1 342 633 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU LeakyRelu_29 1 1 633 345 1 0 ,"
"Convolution Conv_30 1 1 345 636 128 1 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_31 1 1 636 348 1 0 ,"
"Convolution Conv_32 1 1 348 639 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU LeakyRelu_33 1 1 639 351 1 0 ,"
"Convolution Conv_34 1 1 351 642 128 1 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_35 1 1 642 354 1 0 ,"
"Convolution Conv_36 1 1 354 645 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU LeakyRelu_37 1 1 645 357 1 0 ,"
"Convolution Conv_38 1 1 357 648 128 1 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_39 1 1 648 360 1 0 ,"
"Convolution Conv_40 1 1 360 651 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU LeakyRelu_41 1 1 651 363 1 0 ,"
"Convolution Conv_42 1 1 363 654 128 1 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_43 1 1 654 366 1 0 ,"
"Convolution Conv_44 1 1 366 657 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU LeakyRelu_45 1 1 657 369 1 0 ,"
"Convolution Conv_46 1 1 369 660 128 1 128 3 3 2 2 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_47 1 1 660 372 1 0 ,"
"Convolution Conv_48 1 1 372 663 1 128 256 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU LeakyRelu_49 1 1 663 375 1 0 ,"
"Convolution Conv_50 1 1 375 666 256 1 256 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_51 1 1 666 378 1 0 ,"
"Convolution Conv_52 1 1 378 669 1 256 256 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU LeakyRelu_53 1 1 669 381 1 0 ,"
"Convolution Conv_54 1 1 333 672 1 64 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU LeakyRelu_55 1 1 672 384 1 0 ,"
"Convolution Conv_56 1 1 369 675 1 128 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU LeakyRelu_57 1 1 675 387 1 0 ,"
"Convolution Conv_58 1 1 381 678 1 256 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU LeakyRelu_59 1 1 678 390 1 0 ,"
"Shape Shape_60 1 1 387 391 ,"
"Gather Gather_62 1 1 391 393 0 0 1 ,"
"Shape Shape_63 1 1 387 394 ,"
"Gather Gather_65 1 1 394 396 0 0 1 ,"
"Unsqueeze Unsqueeze_66 1 1 393 397 1 0 ,"
"Unsqueeze Unsqueeze_67 1 1 396 398 1 0 ,"
"Concat Concat_68 2 1 397 398 399 0 ,"
"Shape Shape_69 1 1 390 400 ,"
"StridedSliceV2 Slice_73 1 1 400 404 1 0 1 2 1 0 1 1 ,"
"Cast Cast_74 1 1 399 405 3 ,"
"Concat Concat_75 2 1 404 405 406 0 ,"
"Upsample Resize_78 4 1 390 407 408 406 409 1 0 0 0 20 20 ,"
"Add Add_79 2 1 387 409 410 -1 ,"
"Convolution Conv_80 1 1 410 681 1 64 64 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_81 1 1 681 413 1 0 ,"
"Shape Shape_82 1 1 384 414 ,"
"Gather Gather_84 1 1 414 416 0 0 1 ,"
"Shape Shape_85 1 1 384 417 ,"
"Gather Gather_87 1 1 417 419 0 0 1 ,"
"Unsqueeze Unsqueeze_88 1 1 416 420 1 0 ,"
"Unsqueeze Unsqueeze_89 1 1 419 421 1 0 ,"
"Concat Concat_90 2 1 420 421 422 0 ,"
"Shape Shape_91 1 1 413 423 ,"
"StridedSliceV2 Slice_95 1 1 423 427 1 0 1 2 1 0 1 1 ,"
"Cast Cast_96 1 1 422 428 3 ,"
"Concat Concat_97 2 1 427 428 429 0 ,"
"Upsample Resize_100 4 1 413 430 431 429 432 1 0 0 0 40 40 ,"
"Add Add_101 2 1 384 432 433 -1 ,"
"Convolution Conv_102 1 1 433 684 1 64 64 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_103 1 1 684 436 1 0 ,"
"Convolution Conv_104 1 1 436 687 1 64 32 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_105 1 1 436 690 1 64 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_106 1 1 690 441 1 0 ,"
"Convolution Conv_107 1 1 441 693 1 16 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_108 1 1 441 696 1 16 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_109 1 1 696 446 1 0 ,"
"Convolution Conv_110 1 1 446 699 1 16 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Concat Concat_111 3 1 687 693 699 449 1 ,"
"ReLU Relu_112 1 1 449 450 ,"
"Convolution Conv_113 1 1 413 702 1 64 32 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_114 1 1 413 705 1 64 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_115 1 1 705 455 1 0 ,"
"Convolution Conv_116 1 1 455 708 1 16 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_117 1 1 455 711 1 16 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_118 1 1 711 460 1 0 ,"
"Convolution Conv_119 1 1 460 714 1 16 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Concat Concat_120 3 1 702 708 714 463 1 ,"
"ReLU Relu_121 1 1 463 464 ,"
"Convolution Conv_122 1 1 390 717 1 64 32 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_123 1 1 390 720 1 64 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_124 1 1 720 469 1 0 ,"
"Convolution Conv_125 1 1 469 723 1 16 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_126 1 1 469 726 1 16 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU LeakyRelu_127 1 1 726 474 1 0 ,"
"Convolution Conv_128 1 1 474 729 1 16 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Concat Concat_129 3 1 717 723 729 477 1 ,"
"ReLU Relu_130 1 1 477 478 ,"
"Convolution Conv_131 1 1 450 479 1 64 8 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Permute Transpose_132 1 1 479 480 4 0 2 3 1 ,"
"Shape Shape_133 1 1 480 481 ,"
"Gather Gather_135 1 1 481 483 0 0 1 ,"
"Unsqueeze Unsqueeze_136 1 1 483 486 1 0 ,"
"Concat Concat_137 3 1 486 732 733 489 0 ,"
"Reshape Reshape_138 2 1 480 489 490 0 3 3 0 -1 4 0 ,"
"Convolution Conv_139 1 1 464 491 1 64 8 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Permute Transpose_140 1 1 491 492 4 0 2 3 1 ,"
"Shape Shape_141 1 1 492 493 ,"
"Gather Gather_143 1 1 493 495 0 0 1 ,"
"Unsqueeze Unsqueeze_144 1 1 495 498 1 0 ,"
"Concat Concat_145 3 1 498 734 735 501 0 ,"
"Reshape Reshape_146 2 1 492 501 502 0 3 3 0 -1 4 0 ,"
"Convolution Conv_147 1 1 478 503 1 64 8 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Permute Transpose_148 1 1 503 504 4 0 2 3 1 ,"
"Shape Shape_149 1 1 504 505 ,"
"Gather Gather_151 1 1 505 507 0 0 1 ,"
"Unsqueeze Unsqueeze_152 1 1 507 510 1 0 ,"
"Concat Concat_153 3 1 510 736 737 513 0 ,"
"Reshape Reshape_154 2 1 504 513 514 0 3 3 0 -1 4 0 ,"
"Concat Concat_155 3 1 490 502 514 loc 1 ,"
"Convolution Conv_156 1 1 450 516 1 64 4 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Permute Transpose_157 1 1 516 517 4 0 2 3 1 ,"
"Shape Shape_158 1 1 517 518 ,"
"Gather Gather_160 1 1 518 520 0 0 1 ,"
"Unsqueeze Unsqueeze_161 1 1 520 523 1 0 ,"
"Concat Concat_162 3 1 523 738 739 526 0 ,"
"Reshape Reshape_163 2 1 517 526 527 0 3 3 0 -1 2 0 ,"
"Convolution Conv_164 1 1 464 528 1 64 4 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Permute Transpose_165 1 1 528 529 4 0 2 3 1 ,"
"Shape Shape_166 1 1 529 530 ,"
"Gather Gather_168 1 1 530 532 0 0 1 ,"
"Unsqueeze Unsqueeze_169 1 1 532 535 1 0 ,"
"Concat Concat_170 3 1 535 740 741 538 0 ,"
"Reshape Reshape_171 2 1 529 538 539 0 3 3 0 -1 2 0 ,"
"Convolution Conv_172 1 1 478 540 1 64 4 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Permute Transpose_173 1 1 540 541 4 0 2 3 1 ,"
"Shape Shape_174 1 1 541 542 ,"
"Gather Gather_176 1 1 542 544 0 0 1 ,"
"Unsqueeze Unsqueeze_177 1 1 544 547 1 0 ,"
"Concat Concat_178 3 1 547 742 743 550 0 ,"
"Reshape Reshape_179 2 1 541 550 551 0 3 3 0 -1 2 0 ,"
"Concat Concat_180 3 1 527 539 551 552 1 ,"
"Convolution Conv_181 1 1 450 553 1 64 20 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Permute Transpose_182 1 1 553 554 4 0 2 3 1 ,"
"Shape Shape_183 1 1 554 555 ,"
"Gather Gather_185 1 1 555 557 0 0 1 ,"
"Unsqueeze Unsqueeze_186 1 1 557 560 1 0 ,"
"Concat Concat_187 3 1 560 744 745 563 0 ,"
"Reshape Reshape_188 2 1 554 563 564 0 3 3 0 -1 10 0 ,"
"Convolution Conv_189 1 1 464 565 1 64 20 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Permute Transpose_190 1 1 565 566 4 0 2 3 1 ,"
"Shape Shape_191 1 1 566 567 ,"
"Gather Gather_193 1 1 567 569 0 0 1 ,"
"Unsqueeze Unsqueeze_194 1 1 569 572 1 0 ,"
"Concat Concat_195 3 1 572 746 747 575 0 ,"
"Reshape Reshape_196 2 1 566 575 576 0 3 3 0 -1 10 0 ,"
"Convolution Conv_197 1 1 478 577 1 64 20 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Permute Transpose_198 1 1 577 578 4 0 2 3 1 ,"
"Shape Shape_199 1 1 578 579 ,"
"Gather Gather_201 1 1 579 581 0 0 1 ,"
"Unsqueeze Unsqueeze_202 1 1 581 584 1 0 ,"
"Concat Concat_203 3 1 584 748 749 587 0 ,"
"Reshape Reshape_204 2 1 578 587 588 0 3 3 0 -1 0 0 ,"
"Concat Concat_205 3 1 564 576 588 landms 1 ,"
"SoftmaxCaffe Softmax_206 1 1 552 conf 2 ,"
